using System;

namespace Task01
{
    class Program
    {
        static void Main()
        {
            //-----------------------------------------------------------------------------------------------------------
            LinearFunction lfun = new LinearFunction(); //используем конструктор по умолчанию

            Console.WriteLine("********************************************************************************");
            Console.WriteLine("Вариант 1. Используем конструктор по умолчанию а={0}, b={1}", lfun.A, lfun.B); //вывод значений на экран

            for (int i = 1; i < 50; i++)
            {
                Console.Write(lfun.LFunction(i)+" "); //вывод значений на экран
            }
            Console.WriteLine();

            //-----------------------------------------------------------------------------------------------------------
            //возмем, для примера, любой другой частный случай
            lfun.A = 1;
            lfun.B = 2;
            Console.WriteLine("********************************************************************************");
            Console.WriteLine("Вариант 2. Используем значения а={0}, b={1}", lfun.A, lfun.B); //вывод значений на экран

            for (int i = 1; i < 50; i++)
            {
                Console.Write(lfun.LFunction(i) + " "); //вывод значений на экран
            }
            Console.WriteLine();

            //-----------------------------------------------------------------------------------------------------------
            LinearFunction lfun2 = new LinearFunction(5, 10); //используем специальный конструктор c передачей значений

            Console.WriteLine("********************************************************************************");
            Console.WriteLine("Вариант 3. Используем значения а={0}, b={1}", lfun2.A, lfun2.B); //вывод значений на экран

            for (int i = 1; i < 50; i++)
            {
                Console.Write(lfun2.LFunction(i) + " "); //вывод значений на экран
            }
            Console.ReadKey();



        }
    }
}
